//
//  Zodiac.swift
//  Homework 15
//
//  Created by vako on 10.04.24.
//

import UIKit

struct Zodiac {
    let name: String
    let description: String
    let iconName: String
    let polarSign: String
    let polarSignName: String
    
    init(name: String, description: String, iconName: String, polarSign: String, polarSignName:String) {
        self.name = name
        self.description = description
        self.iconName = iconName
        self.polarSign = polarSign
        self.polarSignName = polarSign
    }
    
    static func setupZodiacData() -> [Zodiac] {
        return [
            Zodiac(name: "ვერძი", description: "დაბადებულია მოგებისთვის, ძალიან აქტიური და კომუნიკაბელურია. არის თავმოყვარე, თავდაჯერებული, უშიშარი. მას მართავს გრძნობები, ჯერ აკეთებს და მერე ფიქრობს. იმპულსურია. გრძნობები უბინდავენ გონებას. ვნებიანი და ეგოისტია. ვერ იტანს, როცა რამეს უკრძალავენ. მათში ყველაფერი დიდი დოზითაა. ასევე ავანტიურისტია..", iconName: "ვერძი", polarSign: "სასწორი", polarSignName: "სასწორი"),
            Zodiac(name: "კურო", description: "პრაქტიკული, რეალისტი, პრაგმატული, პესიმისტი, უყვართ და პატივს სცემენ სიმდიდრეს, მაგრამ ხემოჭერილები არიან, უფრთხილდებიან იმას, რაც აქვთ. იზიდავთ გართობა და სიამოვნება. უყვართ სახლი და ოჯახი. მესაკუთრეები და კარგი მშობლები არიან. ჯიუტები, ძლიერი სულის პატრონები და შრომისმოყვარეები არიან. არ აქვთ არასრულყოფილების კომპლექსი. სულის სიღრმეში თავი სამყაროს ღერძებად მიაჩნიათ.", iconName: "კურო", polarSign: "მორიელი", polarSignName: "მორიელი"),
            Zodiac(name: "ტყუპები", description: "ძალიან უყვართ ჭორების და ინფორმაციების შეგროვება. იციან ყველაფერი ყველაფერზე და მათ შეიძლება შეხვდეთ ყველგან. გონებამახვილი, ცოცხალი, კომუნიკაბელური, მჭერმეტყველი.. ეს ყველაფერი ტყუპებზეა ნათქვამი. მათთან არ მოიწყენ. მიისწრაფიან სრულყოფილებისკენ, რათა ყველას თავი მოაწონონ. ადვილად ეგუებიან ყველაფერს. აქვთ უამრავი იდეა... სჭირთ გაორება.", iconName: "ტყუპები", polarSign: "მშვილდოსანი", polarSignName: "მშვილდოსანი"),
            Zodiac(name: "კირჩხიბი", description: " რომანტიკული, გულიანი, უყვართ ბავშვები, ცხოველებიც. აქვთ მაღალი პასუხისმგებლობის გრძნობა. არიან დაკომპლექსებულები, ძალიან ეჭვიანები, თავგანწირულები, სენტიმენტალურები და კონსერვატორები. მესაკუთრეები, მგრძნობიარეები. აქვთ მდიდარი ფანტაზია და კარგი ინტუიცია.", iconName: "კირჩხიბი", polarSign: "თხის რქა", polarSignName: "თხის რქა"),
            Zodiac(name: "ლომი", description: "მამაცი, შეუპოვარი და გულუხვი. ცნობისმოყვარე, გავლენიანი, ცეცხლოვანი, უყვარს მართვა, საკუთარ თავზე შეყვარებული, ეგოცენტრიკი, პრესტიჟი მათთვის ყველაფერია, მიმზიდველი, არტისტული, მაგნიტური, დაბადებულია ლიდერად, რომანტიკული, ქარიზმატული, უყვართ ყურადღების ცენტრში ყოფნა და ხშირად იმსახურებენ კიდეც.", iconName: "ლომი", polarSign: "მერწყული", polarSignName: "მერწყული"),
            Zodiac(name: "ქალწული", description:"ლანეტა მერკურის გავლენის ქვეშ დაბადებული ქალწულები, მოწესრიგებულობით, უზადო პასუხისმგებლობის გრძნობით დათავშეკავებული, პედანტური, ანალიტიკური გონება, კრიტიკოსი, ყურადღებას აქცევს წვრილმანებს, რაციონალური, გამოთვლილი და დაგეგმილი აქვს ყველაფერი. პრაქტიკოსი, მომთხოვნი, საღი გონების პატრონი.", iconName: "ქალწული", polarSign: "თევზები", polarSignName: "თევზები"),
            Zodiac(name: "სასწორი", description: "გაუბედავი, ჰარმონიული, პაცეფისტი, დამთმობი, გაურბის კონფლიქტეპს, დიპლომატი, არ უყვარს მარტოობა, ხშირად სისულელეებს აკეთებს, იდეალისტი, რომანტიკოსი, მიმზიდველი, უყვარს ხელოვნება, ახასიათებს მოუთმენლობა.", iconName: "სასწორი", polarSign: "ვერძი", polarSignName: "ვერძი"),
            Zodiac(name: "მორიელი", description: "მიდრეკილია დაპყრობისკენ, მისი დევიზია ყველაფერი ან არაფერი, ვნებიანია, მოსწონს მისტიკა, არღვევს ტაბუებს, თავდაჯერებული და მესაკუთრეა. ჯიუტი, რისკიანი, ემოციური, მიმწოლი ხასიათისაა", iconName: "მორიელი", polarSign: "კურო", polarSignName: "კურო"),
            Zodiac(name: "მშვილდოსანი", description: "პირდაპირი, სამართლიანი, აგრესიული ოპტიმისტი, უყვარს ძებნა და პოვნა, არ აქვს ზომიერების შეგრძნება, სულ მოძრაობს, ფარული სურვილი აქვს ფლობის, იმპულსურია.", iconName: "მშვილდოსანი", polarSign: "ტყუპები", polarSignName: "ტყუპები"),
            Zodiac(name: "თხის რქა", description: "ახასიათებს თავმოყვარეობა, სიმდიდრის სიყვარული, პრაგმატულობა, სიფრთხილე, ამბიციურობა, თავშეკავებულობა, დამოუკიდებლობა . მათთვის ძალიან მნიშვნელოვანია მატერიალური კეთილდღეობა და სტატუსი. არიან კარიერისტები და კონსერვატორები.მერწყული: ორიგინალური, ალტრუისტი, იდეალისტი, იდეალური მებრძოლი, კომუნიკაბელური, თავისუფლების მოყვარული, ექსტრავაგანტული, უყვარს პუბლიკის შოკურ მდგომარეობამდე მიყვანა. არიან ინტელექტუალები, ვერ იტანენ რუტინულ ცხოვრებას.", iconName: "თხის რქა", polarSign: "კირჩხიბი", polarSignName: "კირჩხიბი"),
            Zodiac(name: "თევზები", description: "მგრძნობიარე მეოცნებეები, მდიდარი ფანტაზია, მიმზიდველობა, შემოქმედებითი ხასიათი, არტისტიზმი, პასიურები, გაუბედავები, ფატალურები, რეფლექსურები, აქვთ კარგი ინტუიცია.", iconName: "თევზები", polarSign: "ქალწული", polarSignName: "ქალწული"),
            Zodiac(name: "მერწყული", description: "მერ­წყუ­ლის უმ­თავ­რე­სი მი­ზა­ნი პერ­სო­ნა­ლუ­რი თუ სო­ცი­ა­ლუ­რი დოგმე­ბის­გან და შე­ზღუდ­ვე­ბის­გან გა­თა­ვი­სუფ­ლე­ბაა. გსურთ, რომ ჰგავ­დეთ არა­ვის! რომ მხო­ლოდ თქვე­ნი თავი იყოთ და სულ არა­ორ­დი­ნა­ლუ­რი ქცე­ვე­ბით, ცხოვ­რე­ბის წე­სი­თა, თუ მო­საზ­რე­ბე­ბით გა­მო­ირ­ჩე­ვით. თქვენ ყო­ველ­თვის იმის სა­წი­ნა­აღ­მდე­გო მხა­რეს დგა­ხართ, სა­დაც მასა დგას და რა პო­ზი­ცი­ა­ში იქ­ნე­ბით მთლი­ა­ნად მა­სა­ზეა და­მო­კი­დე­ბუ­ლი. იდე­ა­ლის­ტო­ბის­კენ ხართ მიდ­რე­კი­ლი.", iconName: "მერწყული", polarSign: "ლომი", polarSignName: "ლომი"),
            
        ]
    }
}

